src/runtime/components/guard/add_user/tests/index.org
#+title: Test Setup for Add-User Command Handler
#+AUTHOR: VLEAD
#+DATE: [2017-04-11 Tue]
#+SETUPFILE: ../../org-templates/level-3.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil

* Test Harness

Instantiates a =Guard= component and populates it with the
=AddUser= command handler. 

** Imports
#+BEGIN_SRC python :tangle harness.py
import unittest
from unittest import TestCase
from runtime.components.guard.guard import Guard
from runtime.components.guard.add_user.add_user import AddUser
from runtime.emgrs.svem.svem import EntityMgr
from runtime.objects.email.email import Email
from runtime.objects.name.name import Name
from runtime.objects.role.role import Role
from runtime.objects.user.user import User
from runtime.objects.session.session import Session
from runtime.datatypes.cmd.cmd import Cmd

#+END_SRC

** Class TestHarness

This class's =setUp= method sets up the context for running
tests on the =add_user= route for the guard component. 

 - Creates an entity manager
 - Creates a guard component with that entity manager
 - Adds the =add_user='s command handlers (=AddUser.do=)
 - Create a user with role admin
 - Add user to set using entity manager 
 - Creates a session object with this user and admin role
 - Adds the session to the entity manager as an entity
 - Saves the session as a field for access to the test cases 

#+BEGIN_SRC python :tangle harness.py
class TestHarness(TestCase):
    TESTING = True

    def setUp(self):
        # create component
        self.em = EntityMgr()
        self.component = Guard(self.em)

        # add cmd handler to it
        self.component.add_cmd_handler(Cmd.add_user, AddUser.do)

        user = User(name=Name(val="Jimi Hendrix"),
                    email=Email(val="jimi@gnu.org"),
                    roles=[Role.admin])

        self.component.em.add_user(user)

        session = Session(user=user, role=Role.admin, key="some_random_key_8798734")

        self.component.em.add_session(session)

        self.session = session

    def tearDown(self):
        self.component = None

#+END_SRC

* Package

#+BEGIN_SRC python :eval no :tangle __init__.py
print "runtime.components.guard.add_user.tests package"
#+END_SRC
