build/docs/runtime/components/guard/add_user/tests/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Test Setup for Add-User Command Handler</title>
<!-- 2017-04-27 Thu 09:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
</head>
<body>
<div id="content">
<h1 class="title">Test Setup for Add-User Command Handler</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Test Harness</a>
<ul>
<li><a href="#sec-1-1">1.1. Imports</a></li>
<li><a href="#sec-1-2">1.2. Class TestHarness</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Package</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Test Harness</h2>
<div class="outline-text-2" id="text-1">
<p>
Instantiates a <code>Guard</code> component and populates it with the
<code>AddUser</code> command handler. 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Imports</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> unittest
<span style="font-weight: bold;">from</span> unittest <span style="font-weight: bold;">import</span> TestCase
<span style="font-weight: bold;">from</span> runtime.components.guard.guard <span style="font-weight: bold;">import</span> Guard
<span style="font-weight: bold;">from</span> runtime.components.guard.add_user.add_user <span style="font-weight: bold;">import</span> AddUser
<span style="font-weight: bold;">from</span> runtime.emgrs.svem.svem <span style="font-weight: bold;">import</span> EntityMgr
<span style="font-weight: bold;">from</span> runtime.objects.email.email <span style="font-weight: bold;">import</span> Email
<span style="font-weight: bold;">from</span> runtime.objects.name.name <span style="font-weight: bold;">import</span> Name
<span style="font-weight: bold;">from</span> runtime.objects.role.role <span style="font-weight: bold;">import</span> Role
<span style="font-weight: bold;">from</span> runtime.objects.user.user <span style="font-weight: bold;">import</span> User
<span style="font-weight: bold;">from</span> runtime.objects.session.session <span style="font-weight: bold;">import</span> Session
<span style="font-weight: bold;">from</span> runtime.datatypes.cmd.cmd <span style="font-weight: bold;">import</span> Cmd
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Class TestHarness</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This class's <code>setUp</code> method sets up the context for running
tests on the <code>add_user</code> route for the guard component. 
</p>

<ul class="org-ul">
<li>Creates an entity manager
</li>
<li>Creates a guard component with that entity manager
</li>
<li>Adds the <code>add_user</code>'s command handlers (<code>AddUser.do</code>)
</li>
<li>Create a user with role admin
</li>
<li>Add user to set using entity manager 
</li>
<li>Creates a session object with this user and admin role
</li>
<li>Adds the session to the entity manager as an entity
</li>
<li>Saves the session as a field for access to the test cases 
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestHarness</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">setUp</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">create component</span>
        <span style="font-weight: bold;">self</span>.em = EntityMgr()
        <span style="font-weight: bold;">self</span>.component = Guard(<span style="font-weight: bold;">self</span>.em)

        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">add cmd handler to it</span>
        <span style="font-weight: bold;">self</span>.component.add_cmd_handler(Cmd.add_user, AddUser.do)

        <span style="font-weight: bold; font-style: italic;">user</span> = User(name=Name(val=<span style="font-style: italic;">"Jimi Hendrix"</span>),
                    email=Email(val=<span style="font-style: italic;">"jimi@gnu.org"</span>),
                    roles=[Role.admin])

        <span style="font-weight: bold;">self</span>.component.em.add_user(user)

        <span style="font-weight: bold; font-style: italic;">session</span> = Session(user=user, role=Role.admin, key=<span style="font-style: italic;">"some_random_key_8798734"</span>)

        <span style="font-weight: bold;">self</span>.component.em.add_session(session)

        <span style="font-weight: bold;">self</span>.session = session

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">tearDown</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.component = <span style="font-weight: bold; text-decoration: underline;">None</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Package</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">print</span> <span style="font-style: italic;">"runtime.components.guard.add_user.tests package"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-11 Tue]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
